==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
Spiking_DenseReLUKAN                     [16, 10]                  655,360
├─ModuleList: 1-1                        --                        133,248
│    └─ReLUKANLayer: 2-1                 [16, 128]                 12,544
│    │    └─Conv2d: 3-1                  [16, 128, 1, 1]           802,944
│    └─ReLUKANLayer: 2-2                 [16, 128]                 2,048
│    │    └─Conv2d: 3-2                  [16, 128, 1, 1]           131,200
│    └─ReLUKANLayer: 2-3                 [16, 128]                 2,048
│    │    └─Conv2d: 3-3                  [16, 128, 1, 1]           131,200
│    └─ReLUKANLayer: 2-4                 [16, 128]                 2,048
│    │    └─Conv2d: 3-4                  [16, 128, 1, 1]           131,200
│    └─ReLUKANLayer: 2-5                 [16, 128]                 2,048
│    │    └─Conv2d: 3-5                  [16, 128, 1, 1]           131,200
│    └─ReLUKANLayer: 2-6                 [16, 128]                 (recursive)
│    │    └─Conv2d: 3-6                  [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-7                 [16, 128]                 (recursive)
│    │    └─Conv2d: 3-7                  [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-8                 [16, 128]                 (recursive)
│    │    └─Conv2d: 3-8                  [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-9                 [16, 128]                 (recursive)
│    │    └─Conv2d: 3-9                  [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-10                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-10                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-11                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-11                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-12                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-12                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-13                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-13                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-14                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-14                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-15                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-15                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-16                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-16                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-17                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-17                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-18                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-18                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-19                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-19                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-20                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-20                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-21                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-21                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-22                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-22                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-23                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-23                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-24                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-24                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-25                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-25                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-26                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-26                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-27                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-27                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-28                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-28                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-29                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-29                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-30                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-30                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-31                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-31                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-32                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-32                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-33                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-33                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-34                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-34                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-35                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-35                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-36                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-36                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-37                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-37                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-38                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-38                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-39                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-39                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-40                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-40                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-41                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-41                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-42                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-42                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-43                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-43                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-44                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-44                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-45                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-45                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-46                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-46                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-47                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-47                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-48                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-48                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-49                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-49                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-50                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-50                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-51                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-51                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-52                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-52                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-53                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-53                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-54                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-54                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-55                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-55                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-56                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-56                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-57                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-57                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-58                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-58                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-59                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-59                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-60                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-60                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-61                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-61                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-62                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-62                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-63                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-63                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-64                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-64                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-65                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-65                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-66                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-66                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-67                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-67                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-68                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-68                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-69                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-69                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-70                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-70                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-71                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-71                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-72                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-72                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-73                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-73                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-74                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-74                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-75                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-75                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-76                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-76                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-77                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-77                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-78                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-78                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-79                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-79                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-80                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-80                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-81                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-81                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-82                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-82                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-83                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-83                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-84                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-84                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-85                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-85                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-86                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-86                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-87                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-87                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-88                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-88                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-89                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-89                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-90                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-90                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-91                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-91                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-92                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-92                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-93                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-93                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-94                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-94                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-95                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-95                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-96                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-96                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-97                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-97                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-98                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-98                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-99                [16, 128]                 (recursive)
│    │    └─Conv2d: 3-99                 [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-100               [16, 128]                 (recursive)
│    │    └─Conv2d: 3-100                [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-101               [16, 128]                 (recursive)
│    │    └─Conv2d: 3-101                [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-102               [16, 128]                 (recursive)
│    │    └─Conv2d: 3-102                [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-103               [16, 128]                 (recursive)
│    │    └─Conv2d: 3-103                [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-104               [16, 128]                 (recursive)
│    │    └─Conv2d: 3-104                [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-105               [16, 128]                 (recursive)
│    │    └─Conv2d: 3-105                [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-106               [16, 128]                 (recursive)
│    │    └─Conv2d: 3-106                [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-107               [16, 128]                 (recursive)
│    │    └─Conv2d: 3-107                [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-108               [16, 128]                 (recursive)
│    │    └─Conv2d: 3-108                [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-109               [16, 128]                 (recursive)
│    │    └─Conv2d: 3-109                [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-110               [16, 128]                 (recursive)
│    │    └─Conv2d: 3-110                [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-111               [16, 128]                 (recursive)
│    │    └─Conv2d: 3-111                [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-112               [16, 128]                 (recursive)
│    │    └─Conv2d: 3-112                [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-113               [16, 128]                 (recursive)
│    │    └─Conv2d: 3-113                [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-114               [16, 128]                 (recursive)
│    │    └─Conv2d: 3-114                [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-115               [16, 128]                 (recursive)
│    │    └─Conv2d: 3-115                [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-116               [16, 128]                 (recursive)
│    │    └─Conv2d: 3-116                [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-117               [16, 128]                 (recursive)
│    │    └─Conv2d: 3-117                [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-118               [16, 128]                 (recursive)
│    │    └─Conv2d: 3-118                [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-119               [16, 128]                 (recursive)
│    │    └─Conv2d: 3-119                [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-120               [16, 128]                 (recursive)
│    │    └─Conv2d: 3-120                [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-121               [16, 128]                 (recursive)
│    │    └─Conv2d: 3-121                [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-122               [16, 128]                 (recursive)
│    │    └─Conv2d: 3-122                [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-123               [16, 128]                 (recursive)
│    │    └─Conv2d: 3-123                [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-124               [16, 128]                 (recursive)
│    │    └─Conv2d: 3-124                [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-125               [16, 128]                 (recursive)
│    │    └─Conv2d: 3-125                [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-126               [16, 128]                 (recursive)
│    │    └─Conv2d: 3-126                [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-127               [16, 128]                 (recursive)
│    │    └─Conv2d: 3-127                [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-128               [16, 128]                 (recursive)
│    │    └─Conv2d: 3-128                [16, 128, 1, 1]           (recursive)
│    └─ReLUKANLayer: 2-129               [16, 128]                 (recursive)
│    │    └─Conv2d: 3-129                [16, 128, 1, 1]           (recursive)
├─LSTM: 1-2                              [32, 16, 256]             659,456
├─ReLUKANLayer: 1-3                      [16, 10]                  4,096
│    └─Conv2d: 2-130                     [16, 10, 1, 1]            20,490
==========================================================================================
Total params: 2,821,130
Trainable params: 2,821,130
Non-trainable params: 0
Total mult-adds (M): 619.51
==========================================================================================
Input size (MB): 0.05
Forward/backward pass size (MB): 3.16
Params size (MB): 8.03
Estimated Total Size (MB): 11.24
==========================================================================================