==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
Spiking_DenseMLP                         [16, 10]                  655,360
├─ModuleList: 1-1                        --                        16,384
│    └─Linear: 2-1                       [16, 128]                 100,352
│    └─Linear: 2-2                       [16, 128]                 16,384
│    └─Linear: 2-3                       [16, 128]                 16,384
│    └─Linear: 2-4                       [16, 128]                 16,384
│    └─Linear: 2-5                       [16, 128]                 16,384
│    └─Linear: 2-6                       [16, 128]                 (recursive)
│    └─Linear: 2-7                       [16, 128]                 (recursive)
│    └─Linear: 2-8                       [16, 128]                 (recursive)
│    └─Linear: 2-9                       [16, 128]                 (recursive)
│    └─Linear: 2-10                      [16, 128]                 (recursive)
│    └─Linear: 2-11                      [16, 128]                 (recursive)
│    └─Linear: 2-12                      [16, 128]                 (recursive)
│    └─Linear: 2-13                      [16, 128]                 (recursive)
│    └─Linear: 2-14                      [16, 128]                 (recursive)
│    └─Linear: 2-15                      [16, 128]                 (recursive)
│    └─Linear: 2-16                      [16, 128]                 (recursive)
│    └─Linear: 2-17                      [16, 128]                 (recursive)
│    └─Linear: 2-18                      [16, 128]                 (recursive)
│    └─Linear: 2-19                      [16, 128]                 (recursive)
│    └─Linear: 2-20                      [16, 128]                 (recursive)
│    └─Linear: 2-21                      [16, 128]                 (recursive)
│    └─Linear: 2-22                      [16, 128]                 (recursive)
│    └─Linear: 2-23                      [16, 128]                 (recursive)
│    └─Linear: 2-24                      [16, 128]                 (recursive)
│    └─Linear: 2-25                      [16, 128]                 (recursive)
│    └─Linear: 2-26                      [16, 128]                 (recursive)
│    └─Linear: 2-27                      [16, 128]                 (recursive)
│    └─Linear: 2-28                      [16, 128]                 (recursive)
│    └─Linear: 2-29                      [16, 128]                 (recursive)
│    └─Linear: 2-30                      [16, 128]                 (recursive)
│    └─Linear: 2-31                      [16, 128]                 (recursive)
│    └─Linear: 2-32                      [16, 128]                 (recursive)
│    └─Linear: 2-33                      [16, 128]                 (recursive)
│    └─Linear: 2-34                      [16, 128]                 (recursive)
│    └─Linear: 2-35                      [16, 128]                 (recursive)
│    └─Linear: 2-36                      [16, 128]                 (recursive)
│    └─Linear: 2-37                      [16, 128]                 (recursive)
│    └─Linear: 2-38                      [16, 128]                 (recursive)
│    └─Linear: 2-39                      [16, 128]                 (recursive)
│    └─Linear: 2-40                      [16, 128]                 (recursive)
│    └─Linear: 2-41                      [16, 128]                 (recursive)
│    └─Linear: 2-42                      [16, 128]                 (recursive)
│    └─Linear: 2-43                      [16, 128]                 (recursive)
│    └─Linear: 2-44                      [16, 128]                 (recursive)
│    └─Linear: 2-45                      [16, 128]                 (recursive)
│    └─Linear: 2-46                      [16, 128]                 (recursive)
│    └─Linear: 2-47                      [16, 128]                 (recursive)
│    └─Linear: 2-48                      [16, 128]                 (recursive)
│    └─Linear: 2-49                      [16, 128]                 (recursive)
│    └─Linear: 2-50                      [16, 128]                 (recursive)
│    └─Linear: 2-51                      [16, 128]                 (recursive)
│    └─Linear: 2-52                      [16, 128]                 (recursive)
│    └─Linear: 2-53                      [16, 128]                 (recursive)
│    └─Linear: 2-54                      [16, 128]                 (recursive)
│    └─Linear: 2-55                      [16, 128]                 (recursive)
│    └─Linear: 2-56                      [16, 128]                 (recursive)
│    └─Linear: 2-57                      [16, 128]                 (recursive)
│    └─Linear: 2-58                      [16, 128]                 (recursive)
│    └─Linear: 2-59                      [16, 128]                 (recursive)
│    └─Linear: 2-60                      [16, 128]                 (recursive)
│    └─Linear: 2-61                      [16, 128]                 (recursive)
│    └─Linear: 2-62                      [16, 128]                 (recursive)
│    └─Linear: 2-63                      [16, 128]                 (recursive)
│    └─Linear: 2-64                      [16, 128]                 (recursive)
│    └─Linear: 2-65                      [16, 128]                 (recursive)
│    └─Linear: 2-66                      [16, 128]                 (recursive)
│    └─Linear: 2-67                      [16, 128]                 (recursive)
│    └─Linear: 2-68                      [16, 128]                 (recursive)
│    └─Linear: 2-69                      [16, 128]                 (recursive)
│    └─Linear: 2-70                      [16, 128]                 (recursive)
│    └─Linear: 2-71                      [16, 128]                 (recursive)
│    └─Linear: 2-72                      [16, 128]                 (recursive)
│    └─Linear: 2-73                      [16, 128]                 (recursive)
│    └─Linear: 2-74                      [16, 128]                 (recursive)
│    └─Linear: 2-75                      [16, 128]                 (recursive)
│    └─Linear: 2-76                      [16, 128]                 (recursive)
│    └─Linear: 2-77                      [16, 128]                 (recursive)
│    └─Linear: 2-78                      [16, 128]                 (recursive)
│    └─Linear: 2-79                      [16, 128]                 (recursive)
│    └─Linear: 2-80                      [16, 128]                 (recursive)
│    └─Linear: 2-81                      [16, 128]                 (recursive)
│    └─Linear: 2-82                      [16, 128]                 (recursive)
│    └─Linear: 2-83                      [16, 128]                 (recursive)
│    └─Linear: 2-84                      [16, 128]                 (recursive)
│    └─Linear: 2-85                      [16, 128]                 (recursive)
│    └─Linear: 2-86                      [16, 128]                 (recursive)
│    └─Linear: 2-87                      [16, 128]                 (recursive)
│    └─Linear: 2-88                      [16, 128]                 (recursive)
│    └─Linear: 2-89                      [16, 128]                 (recursive)
│    └─Linear: 2-90                      [16, 128]                 (recursive)
│    └─Linear: 2-91                      [16, 128]                 (recursive)
│    └─Linear: 2-92                      [16, 128]                 (recursive)
│    └─Linear: 2-93                      [16, 128]                 (recursive)
│    └─Linear: 2-94                      [16, 128]                 (recursive)
│    └─Linear: 2-95                      [16, 128]                 (recursive)
│    └─Linear: 2-96                      [16, 128]                 (recursive)
│    └─Linear: 2-97                      [16, 128]                 (recursive)
│    └─Linear: 2-98                      [16, 128]                 (recursive)
│    └─Linear: 2-99                      [16, 128]                 (recursive)
│    └─Linear: 2-100                     [16, 128]                 (recursive)
│    └─Linear: 2-101                     [16, 128]                 (recursive)
│    └─Linear: 2-102                     [16, 128]                 (recursive)
│    └─Linear: 2-103                     [16, 128]                 (recursive)
│    └─Linear: 2-104                     [16, 128]                 (recursive)
│    └─Linear: 2-105                     [16, 128]                 (recursive)
│    └─Linear: 2-106                     [16, 128]                 (recursive)
│    └─Linear: 2-107                     [16, 128]                 (recursive)
│    └─Linear: 2-108                     [16, 128]                 (recursive)
│    └─Linear: 2-109                     [16, 128]                 (recursive)
│    └─Linear: 2-110                     [16, 128]                 (recursive)
│    └─Linear: 2-111                     [16, 128]                 (recursive)
│    └─Linear: 2-112                     [16, 128]                 (recursive)
│    └─Linear: 2-113                     [16, 128]                 (recursive)
│    └─Linear: 2-114                     [16, 128]                 (recursive)
│    └─Linear: 2-115                     [16, 128]                 (recursive)
│    └─Linear: 2-116                     [16, 128]                 (recursive)
│    └─Linear: 2-117                     [16, 128]                 (recursive)
│    └─Linear: 2-118                     [16, 128]                 (recursive)
│    └─Linear: 2-119                     [16, 128]                 (recursive)
│    └─Linear: 2-120                     [16, 128]                 (recursive)
│    └─Linear: 2-121                     [16, 128]                 (recursive)
│    └─Linear: 2-122                     [16, 128]                 (recursive)
│    └─Linear: 2-123                     [16, 128]                 (recursive)
│    └─Linear: 2-124                     [16, 128]                 (recursive)
│    └─Linear: 2-125                     [16, 128]                 (recursive)
│    └─Linear: 2-126                     [16, 128]                 (recursive)
│    └─Linear: 2-127                     [16, 128]                 (recursive)
│    └─Linear: 2-128                     [16, 128]                 (recursive)
│    └─Linear: 2-129                     [16, 128]                 (recursive)
├─LSTM: 1-2                              [32, 16, 256]             659,456
├─Linear: 1-3                            [16, 10]                  2,570
==========================================================================================
Total params: 1,499,658
Trainable params: 1,499,658
Non-trainable params: 0
Total mult-adds (M): 372.84
==========================================================================================
Input size (MB): 0.05
Forward/backward pass size (MB): 3.16
Params size (MB): 3.31
Estimated Total Size (MB): 6.53
==========================================================================================